public_html/hugo.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>hugo</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">hugo</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3ea65e1">1. MarkDown</a></li>
<li><a href="#org9bd49f4">2. Crear un enlace interno</a></li>
<li><a href="#org9c8f735">3. Clonar el repositorio</a></li>
<li><a href="#org3875108">4. Insertar</a></li>
<li><a href="#org0e6d7fb">5. Server</a></li>
<li><a href="#org8e609fc">6. Shortcodes</a>
<ul>
<li><a href="#orga074cc8">6.1. Crear un trozo en borrador</a></li>
</ul>
</li>
<li><a href="#orgfd1b9f0">7. TOC - Seleccionar encabezados a mostrar</a></li>
<li><a href="#org05fac96">8. Ordenar post por fecha de modificación</a></li>
</ul>
</div>
</div>
<p>
Hugo es un moderno framework para creación de sitios web de propósito general. Se ubica en la categoría de los nuevos generadores de sitios estáticos,​ basados en la arquitectura dinámica JAMstack y es escrito completamente en Go.
</p>

<div id="outline-container-org3ea65e1" class="outline-2">
<h2 id="org3ea65e1"><span class="section-number-2">1.</span> MarkDown</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://www.markdownguide.org/tools/hugo/">Lista</a> de comandos permitidos.</li>
<li><a href="https://makewithhugo.com/markdown-basics/">Cheatsheet</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9bd49f4" class="outline-2">
<h2 id="org9bd49f4"><span class="section-number-2">2.</span> Crear un enlace interno</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>En el mismo directorio: <code>[Titulo]({{&lt;/* relref"archivo.md" */&gt;}})</code></li>
<li>En un directorio absoluto: <code>[Titulo]({{&lt;/* ref"/dir/archivo.md" */&gt;}})</code></li>
<li>A un apartado del post: <code>[Foo]({{&lt;/* ref "#foo" */&gt;}})</code></li>
<li><p>
A un apartado en un directorio absoluto: <code>[Titulo]({{&lt;/* ref"/dir/archivo.md#foo-" */&gt;}})</code>
</p>
<blockquote>
<p>
Muy importante para este último caso el guión al final del apartado, de no estar, no funciona
</p>
</blockquote></li>
</ul>
</div>
</div>
<div id="outline-container-org9c8f735" class="outline-2">
<h2 id="org9c8f735"><span class="section-number-2">3.</span> Clonar el repositorio</h2>
<div class="outline-text-2" id="text-3">
<p>
git clone &#x2013;recurse-submodules git@gitlab.com:sherlockes/sherlockes.gitlab.io.git
</p>
</div>
</div>

<div id="outline-container-org3875108" class="outline-2">
<h2 id="org3875108"><span class="section-number-2">4.</span> Insertar</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Comentario en plantilla: <code>{{/* This is my comment */}}</code></li>
<li>Tag "more": <code>&lt;!--more--&gt;</code></li>
<li>Trozo de código en línea: <code>~Aquí el código~</code></li>
</ul>
</div>
</div>
<div id="outline-container-org0e6d7fb" class="outline-2">
<h2 id="org0e6d7fb"><span class="section-number-2">5.</span> Server</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><p>
Server en red local: <code>hugo server --bind=192.168.10.202 --baseURL=http://192.168.10.202:1313</code>
</p>
<blockquote>
<p>
Con el parámetro "baseURL" conseguimos que el servidor no muestre el nombre de la carpeta.
</p>
</blockquote></li>
<li>Ver contenido modificado: <code>hugo server -D --navigateToChanged</code></li>
</ul>
</div>
</div>
<div id="outline-container-org8e609fc" class="outline-2">
<h2 id="org8e609fc"><span class="section-number-2">6.</span> Shortcodes</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Escapar shortcode para no evaluarlo: <code>{{&lt;/*/* youtube w7iekruei7 */*/&gt;}}</code></li>
<li>Video de Youtube: <code>{{&lt;/* youtube w7iekruei7 */&gt;}}</code></li>
</ul>
</div>
<div id="outline-container-orga074cc8" class="outline-3">
<h3 id="orga074cc8"><span class="section-number-3">6.1.</span> Crear un trozo en borrador</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-jinja2">{{&lt;/* borrador */&gt;}}
Aquí iremos añadiendo el contenido con el que queremos actualizar la entrada...
{{&lt;/* / borrador */&gt;}}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfd1b9f0" class="outline-2">
<h2 id="orgfd1b9f0"><span class="section-number-2">7.</span> TOC - Seleccionar encabezados a mostrar</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #92a65e; font-weight: bold;">markup</span>]        
  [<span style="color: #92a65e; font-weight: bold;">markup.tableOfContents</span>]
    <span style="color: #cae682;">endLevel</span> = 3
    <span style="color: #cae682;">ordered</span> = <span style="color: #8ac6f2; font-weight: bold;">false</span>
    <span style="color: #cae682;">startLevel</span> = 2
</pre>
</div>
</div>
</div>
<div id="outline-container-org05fac96" class="outline-2">
<h2 id="org05fac96"><span class="section-number-2">8.</span> Ordenar post por fecha de modificación</h2>
<div class="outline-text-2" id="text-8">
<p>
En el archivo config.toml añadir lo siguiente para que se genere la variable "lastmod"
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #cae682;">enableGitInfo</span> = <span style="color: #8ac6f2; font-weight: bold;">true</span>                    

[<span style="color: #92a65e; font-weight: bold;">frontmatter</span>]
  <span style="color: #cae682;">lastmod</span> = [<span style="color: #95e454;">"lastmod"</span>, <span style="color: #95e454;">":git"</span>, <span style="color: #95e454;">"date"</span>, <span style="color: #95e454;">"publishDate"</span>]
</pre>
</div>

<p>
Con esto editaremos el archivo "index.html" del tema para que la línea que genera el Paginator pase de esto
</p>
<div class="org-src-container">
<pre class="src src-html">{{ $paginator := .Paginate (where .Site.RegularPages "Type" "in" .Site.Params.mainSections) }}
</pre>
</div>

<p>
a esto
</p>

<div class="org-src-container">
<pre class="src src-html">{{ $paginator := .Paginate (where .Site.RegularPages "Type" "in" .Site.Params.mainSections).ByLastmod.Reverse }}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-04 lun 13:40</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
